app/views/admins/show.html.erb

SELECT "categories".* FROM "categories"  WHERE "categories"."admin_id" = $1  [["admin_id", 12]]
---
<ul>
   <% @admin.categories.each do |category| %>