app/controllers/admins_controller.rb

INSERT INTO "admins" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @admin = Admin.new admin_params
    if @admin.save

SELECT  "admins".* FROM "admins"  WHERE "admins"."username" = 'People1234' LIMIT 1
---
  def login
    @admin = Admin.find_by(username: params[:username])

SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "admins" SET "email" = $1, "updated_at" = $2 WHERE "admins"."id" = 15  [["email", "liam@gmail.com"], ["updated_at", "2014-12-13 16:33:58.296447"]]
---
  def update
   @admin = Admin.find(params[:id])
   @admin.update_attributes(username: admin_params[:username], email:admin_params[:email])

SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = $1 LIMIT 1  [["id", 10]]
---
  def show
    @admin = Admin.find params[:id]