app/controllers/categories_controller.rb

  def create
    @admin = Admin.find(category_params[:admin_id])
    @admin.categories.create(category_params)
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = $1 LIMIT 1  [["id", 14]]
INSERT INTO "categories" ("admin_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin_id", 14], ["created_at", "2014-12-13 16:10:27.052278"], ["name", "heil"], ["updated_at", "2014-12-13 16:10:27.052278"]]

  def destroy
    category = Category.find(params[:id])
    @admin = category.admin
    category.destroy
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 8]]