app/controllers/posts_controller.rb

  def index
    @posts = Category.find(params[:category_id]).posts.where(parent_id: nil)
---
SELECT "posts".* FROM "posts"  WHERE "posts"."category_id" = $1 AND "posts"."parent_id" IS NULL  [["category_id", 1]]

  def show
    @category = Category.find(params[:category_id])
    @post = @category.posts.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."category_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["category_id", 1], ["id", 1]]

  def new
    respond_to do |format|
      format.html{
    @category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    category = Category.find(params[:category_id])
    @post = category.posts.new(post_params)
    @post.update(user_id: current_user.id)
    if @post.save
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("category_id", "content", "created_at", "parent_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 1], ["content", "aldjldks"], ["created_at", "2014-12-12 23:44:48.977950"], ["parent_id", 1], ["title", "dldaljdsl"], ["updated_at", "2014-12-12 23:44:48.977950"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "posts"."id" = 3  [["content", "my new content"], ["title", "my new title"], ["updated_at", "2014-12-13 01:52:33.685481"]]

  def destroy
    @post = Post.find(params[:id])

    if @post.parent.nil?
      @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]