app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'z' LIMIT 1
---
  def create
    params[:session]
    user = User.find_by(username: params[:session][:username])