app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save