app/controllers/votes_controller.rb

  def create
    @post = Post.find params[:post]
---
SELECT  "posts".* FROM "posts"  LIMIT 1